function Dm = case3 ( A, B, C, D )
% 求解线段AB和CD在异面CASE下的最短距离
%%%%%%%%%%%%%%%%%%%%% (输入变量解释)
% A, B, C, D 分别为两条线段的四个顶点坐标 （1*3 维，单位：mm）
%%%%%%%%%%%%%%%%%%%%% (输入变量解释)
% Dm 为两条线段的最短距离 （ 标量，单位：mm ）

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 求解AB、CD向量及他们之间公垂线L
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
AB = B - A;
CD = D - C;
AC = C - A;

L = cross(AB,CD) / norm( cross(AB,CD) );

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 调整公垂线L的朝向，求解L的长度D1
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if dot(AC,L) > 0
    D1 = dot(AC,L);
else 
    D1 = -dot(AC,L);
    L = -L;
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 求解A、B映射至C、D所在平面的线段AABB与CD的最短距离D2
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
AA = A + D1 * L;
BB = B + D1 * L;
D2 = case2(AA,BB,C,D);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 异面线段AB和CD之间的最短距离
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Dm = sqrt(D1^2+D2^2);
end



    


    
