function Dm = minp2l ( A, B, C )
% 求解点A到线段BC的最短距离
%%%%%%%%%%%%%%%%%%%%% (输入变量解释)
% A, B, C 分别为点和线段的三个顶点坐标 （1*3 维，单位：mm）
%%%%%%%%%%%%%%%%%%%%% (输入变量解释)
% Dm 为点到线段的最短距离 （ 标量，单位：mm ）

%%%%%%%%%%%%%%%
% 准备数据
%%%%%%%%%%%%%%%
BC = C - B;
bc = norm(BC);
alpha = BC / bc;
a = B(1) - A(1);
b = B(2) - A(2);
c = B(3) - A(3);
d = a * alpha(1) + b * alpha(2) + c * alpha(3);

%%%%%%%%%%%%%%%
% 分情况讨论
%%%%%%%%%%%%%%%
if -d >= 0 & -d <= bc                    % 最短距离发生在BC之间
    Dm = sqrt(a^2 + b^2 + c^2 - d^2);
elseif -d < 0                            % 最短距离发生在B点
    Dm = sqrt(a^2 + b^2 + c^2);
else                                     % 最短距离发生在C点
    Dm = sqrt( bc^2 + 2*d*bc + a^2 + b^2 + c^2);
end
end



    


    
